{
  "navigation": {
    "about": "À propos",
    "project": "Projets",
    "contactme": "Contact"
  },
  "about": {
    "title": "À propos",
    "description": "Allo! Je m'appelle Mohammed Ilef, jeune diplômé en informatique et passionné par la technologie. J'aime résoudre des problèmes en développant des logiciels robustes et des solutions évolutives avec des technologies modernes. Mon parcours académique, mes projets personnels et mes expériences professionnelles m'ont doté des compétences nécessaires pour relever de nouveaux défis et saisir de nouvelles opportunités.",
    "downloadCV": "Télécharger CV"
  },
  "petProjects": {
    "title": "Projets personnels",
    "seeMore": "Plus de détails",
    "sourceCode": "Code source",
    "liveVersion": "Visitez la version live",
    "fikra": {
      "title": "Fikra",
      "description": "Un projet full-stack qui est une plateforme pour les développeurs pour partager leurs idées de projets personnels. Il inclut des opérations CRUD sur les publications. Actuellement, je travaille sur l'authentification et l'autorisation de l'application. Le frontend est réalisé avec React, TypeScript et TailwindCSS, tandis que le backend utilise NestJS, TypeScript, PostgreSQL et Prisma. Pour le processus CI/CD, j'utilise GitHub Actions et Render (avec le niveau gratuit pour la livraison continue). La base de données de production est hébergée sur Supabase."
    },
    "sortingAlgorithm": {
      "title": "Visualisateur de tri",
      "description": "Une application simple réalisée avec du JavaScript (vanilla), HTML et CSS. Le but de l'application est de visualiser le tri de barres pour chaque algorithme de tri. L'utilisateur peut générer autant de barres qu'il le souhaite avec des longueurs aléatoires, puis appuyer sur le bouton de démarrage pour les trier. Le temps d'exécution est affiché une fois le tri terminé. L'application est hébergée sur GitHub Pages."
    },
    "passwordGenerator": {
      "title": "Générateur de mots de passes",
      "description": "Une application de générateur de mots de passe réalisée avec React, TypeScript et Styled Components. L'utilisateur peut choisir les critères pour le mot de passe et en générer autant qu'il le souhaite. L'application est documentée dans le fichier README sur GitHub. l'application est hébergée sur GitHub Pages."
    }
  },
  "contactme": {
    "title": "Contactez moi",
    "email": "ilefikhelef@outlook.com",
    "linkedIn": "Me contacter sur LinkedIn"
  }
}
